In [104]:
import pandas as pd
import numpy as np

In [105]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
 
'Budapest_PaRis', 'Brussels_londOn'], 
 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
 
'12. Air France', '"Swiss Air"']})

In [106]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1) Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [107]:
type(df)

pandas.core.frame.DataFrame

In [108]:
df['FlightNumber'].dtypes

dtype('float64')

In [109]:
df["FlightNumber"]

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [110]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [111]:
df['FlightNumber'].dtypes

dtype('int32')

In [112]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2) The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [113]:
tempdf[['From', 'To']] = df.From_To.str.split("_",expand=True)

In [114]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [116]:
tempdf

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

3) Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [117]:
capitalizer = lambda x: x.title()
tempdf['From']=tempdf['From'].map(capitalizer)
tempdf['To']=tempdf['To'].map(capitalizer)
tempdf

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

4) Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [118]:
df.drop('From_To', axis = 1, inplace=True)

In [119]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [120]:
df = df.append(tempdf, ignore_index=True)

In [121]:
df

               Airline  FlightNumber      From  RecentDelays         To
0               KLM(!)         10045       NaN      [23, 47]        NaN
1    <Air France> (12)         10055       NaN            []        NaN
2  (British Airways. )         10065       NaN  [24, 43, 87]        NaN
3       12. Air France         10075       NaN          [13]        NaN
4          "Swiss Air"         10085       NaN      [67, 32]        NaN
5               KLM(!)         10045    London      [23, 47]      Paris
6    <Air France> (12)         10055    Madrid            []      Milan
7  (British Airways. )         10065    London  [24, 43, 87]  Stockholm
8       12. Air France         10075  Budapest          [13]      Paris
9          "Swiss Air"         10085  Brussels      [67, 32]     London

5) In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [122]:
df['RecentDelays'][0][0]

23

In [123]:
df['RecentDelays'].str[0]

0    23.0
1     NaN
2    24.0
3    13.0
4    67.0
5    23.0
6     NaN
7    24.0
8    13.0
9    67.0
Name: RecentDelays, dtype: float64

In [124]:
df['Delay1'] = df['RecentDelays'].str[0]
df['Delay2'] = df['RecentDelays'].str[1]
df['Delay3'] = df['RecentDelays'].str[2]

In [125]:
df.drop('RecentDelays', axis=1, inplace=True)

In [126]:
df

,Airline,FlightNumber,From,To,Delay1,Delay2,Delay3
0,KLM(!),10045,NaN,NaN,23.0,47.0,NaN
1,<Air France> (12),10055,NaN,NaN,NaN,NaN,NaN
2,(British Airways. ),10065,NaN,NaN,24.0,43.0,87.0
3,12. Air France,10075,NaN,NaN,13.0,NaN,NaN
4,"""Swiss Air""",10085,NaN,NaN,67.0,32.0,NaN
5,KLM(!),10045,London,Paris,23.0,47.0,NaN
6,<Air France> (12),10055,Madrid,Milan,NaN,NaN,NaN
7,(British Airways. ),10065,London,Stockholm,24.0,43.0,87.0
8,12. Air France,10075,Budapest,Paris,13.0,NaN,NaN
9,"""Swiss Air""",10085,Brussels,London,67.0,32.0,NaN